HOTKEYS = {}


class Settings:
    """
    Здесь будут хоткеи, описание раундов, правила начисления очков.
    """
    pass


class Pause:
    """При нажимании на хоткей паузы, будет отрисовываться иконка паузы, и игра замирать."""
    pass


class Records:
    """Последние 5 рекордов будут храниться в кеше. Этот класс должен их выводить"""
    pass


class MainMenu:
    """Стартовое меню с настройками, выходом, рекордами, кнопкой играть"""
    pass


class GameOverMenu:
    """Поздравление с новым рекордом, кнопка играть еще, кнопка выхода в главное меню."""
    pass


class Tetromino:
    """Сами фигурки, их коорднаты и рандомный выбор?"""
    pass


class Handler:
    """Будущий обработчик событий, все хоткеи вносятся в словарь хоткеев"""
    pass


class Round:
    """Изменение цвета фигурок, их скорости падения и повявления, надписи раунда на экране. """
    pass


